bouffalolab/bouffalo_sdk/drivers/bl702_driver/hal_drv/src/hal_usb.c
        ///* force BD=1, not use */
        //tmpVal=BL_RD_REG(GLB_BASE,GLB_USB_XCVR);
        //tmpVal=BL_SET_REG_BIT(tmpVal,GLB_PU_USB_LDO);
        //BL_WR_REG(GLB_BASE,GLB_USB_XCVR,tmpVal);

        /* BD_voltage_thresdhold=2.8V */
        tmpVal = BL_RD_REG(GLB_BASE, GLB_USB_XCVR_CONFIG);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, GLB_USB_BD_VTH, 7);
        BL_WR_REG(GLB_BASE, GLB_USB_XCVR_CONFIG, tmpVal);

#else
        tmpVal = BL_RD_REG(GLB_BASE, GLB_USB_XCVR_CONFIG);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, GLB_REG_USB_USE_XCVR, 1); //use internal tranceiver
        BL_WR_REG(GLB_BASE, GLB_USB_XCVR_CONFIG, tmpVal);

        tmpVal = BL_RD_REG(GLB_BASE, GLB_USB_XCVR);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, GLB_USB_ENUM, 0);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, GLB_PU_USB, 1);
        BL_WR_REG(GLB_BASE, GLB_USB_XCVR, tmpVal);
#endif
    }
}

/**
 * @brief
 *
 * @param dev
 * @param oflag
 * @return int
 */
int usb_open(struct device *dev, uint16_t oflag)
{
    USB_Config_Type usbCfg = { 0 };

    usb_set_power_off();
    mtimer_delay_ms(10);
    usb_set_power_up();

    usb_xcvr_config(DISABLE);
    usb_xcvr_config(ENABLE);

    CPU_Interrupt_Disable(USB_IRQn);

    usbCfg.DeviceAddress = 0;
    usbCfg.EnumInEn = ENABLE;
    usbCfg.EnumOutEn = ENABLE;
    usbCfg.RomBaseDescriptorUsed = 0;
    usbCfg.SoftwareCtrl = 1;
    usbCfg.EnumMaxPacketSize = USB_CTRL_EP_MPS;

    /* Init Device */
    USB_Set_Config(DISABLE, &usbCfg);

    usb_fs_device.out_ep[0].ep_ena = 1U;
    usb_fs_device.in_ep[0].ep_ena = 1U;
    usb_fs_device.out_ep[0].ep_cfg.ep_mps = USB_CTRL_EP_MPS;
    usb_fs_device.out_ep[0].ep_cfg.ep_type = USBD_EP_TYPE_CTRL;
    usb_fs_device.in_ep[0].ep_cfg.ep_mps = USB_CTRL_EP_MPS;
    usb_fs_device.in_ep[0].ep_cfg.ep_type = USBD_EP_TYPE_CTRL;

    /* USB interrupt enable config */
    USB_IntEn(USB_INT_ALL, DISABLE);           //all
    USB_IntEn(USB_INT_RESET, ENABLE);          //1
    USB_IntEn(USB_INT_EP0_SETUP_DONE, ENABLE); //5
    USB_IntEn(USB_INT_EP0_IN_DONE, ENABLE);    //7
    USB_IntEn(USB_INT_EP0_OUT_DONE, ENABLE);   //9
    USB_IntEn(USB_INT_RESET_END, ENABLE);      //27

    /* USB interrupt mask config */
    USB_IntMask(USB_INT_ALL, MASK);              //all
    USB_IntMask(USB_INT_RESET, UNMASK);          //1
    USB_IntMask(USB_INT_EP0_SETUP_DONE, UNMASK); //5
    USB_IntMask(USB_INT_EP0_IN_DONE, UNMASK);    //7
    USB_IntMask(USB_INT_EP0_OUT_DONE, UNMASK);   //9
    USB_IntMask(USB_INT_RESET_END, UNMASK);      //27

#ifdef ENABLE_LPM_INT
    USB_IntEn(USB_INT_LPM_PACKET, ENABLE);
    USB_IntEn(USB_INT_LPM_WAKEUP, ENABLE);
    USB_IntMask(USB_INT_LPM_PACKET, UNMASK);
    USB_IntMask(USB_INT_LPM_WAKEUP, UNMASK);

    USB_LPM_Enable();
    USB_Set_LPM_Default_Response(USB_LPM_DEFAULT_RESP_ACK);

#endif

#ifdef ENABLE_SOF3MS_INT
    /* disable sof3ms until reset_end */
    USB_IntEn(USB_INT_LOST_SOF_3_TIMES, DISABLE);
    USB_IntMask(USB_INT_LOST_SOF_3_TIMES, MASK);

    /* recommended enable sof3ms after reset_end */
    USB_IntEn(USB_INT_LOST_SOF_3_TIMES, ENABLE);
    USB_IntMask(USB_INT_LOST_SOF_3_TIMES, UNMASK);
#endif

#ifdef ENABLE_ERROR_INT
    USB_IntEn(USB_INT_ERROR, ENABLE);
    USB_IntMask(USB_INT_ERROR, UNMASK);
#endif
    /*Clear pending interrupts*/
    USB_Clr_IntStatus(USB_INT_ALL);

    Interrupt_Handler_Register(USB_IRQn, USB_FS_IRQ);
    CPU_Interrupt_Enable(USB_IRQn);
    USB_Enable();

    return 0;
}
/**
 * @brief
 *
 * @param dev
 * @return int
 */
int usb_close(struct device *dev)
{
    /* disable all interrupts and force USB reset */
    CPU_Interrupt_Disable(USB_IRQn);
    USB_IntMask(USB_INT_LPM_WAKEUP, MASK);
    USB_IntMask(USB_INT_LPM_PACKET, MASK);

    USB_Disable();

    /* clear interrupt status register */
    USB_Clr_IntStatus(USB_INT_ALL);

    usb_set_power_off();

    usb_xcvr_config(DISABLE);
    return 0;
}
/**
 * @brief
 *
 * @param dev
 * @param cmd
 * @param args
 * @return int
 */
int usb_control(struct device *dev, int cmd, void *args)
{
    struct usb_dc_device *usb_device = (struct usb_dc_device *)dev;

    switch (cmd) {
        case DEVICE_CTRL_SET_INT /* constant-expression */: {
            uint32_t offset = __builtin_ctz((uint32_t)args);

            while (offset < 24) {
                if ((uint32_t)args & (1 << offset)) {
                    USB_IntEn(offset, ENABLE);
                    USB_IntMask(offset, UNMASK); //11
                    //USB_DC_LOG("offset:%d\r\n",offset);
                }

                offset++;
            }
            break;
        }
        case DEVICE_CTRL_CLR_INT /* constant-expression */:
            break;

        case DEVICE_CTRL_USB_DC_SET_ACK /* constant-expression */:
            USB_Set_EPx_Status(USB_EP_GET_IDX(((uint32_t)args) & 0x7f), USB_EP_STATUS_ACK);
            return 0;
        case DEVICE_CTRL_USB_DC_ENUM_ON: {
            uint32_t tmpVal;
            tmpVal = BL_RD_REG(GLB_BASE, GLB_USB_XCVR);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, GLB_USB_ENUM, 1);
            BL_WR_REG(GLB_BASE, GLB_USB_XCVR, tmpVal);
            return 0;
        }
        case DEVICE_CTRL_USB_DC_ENUM_OFF: {
            uint32_t tmpVal;
            tmpVal = BL_RD_REG(GLB_BASE, GLB_USB_XCVR);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, GLB_USB_ENUM, 0);
            BL_WR_REG(GLB_BASE, GLB_USB_XCVR, tmpVal);
            return 0;
        }
        case DEVICE_CTRL_USB_DC_GET_EP_TX_FIFO_CNT:
            return USB_Get_EPx_TX_FIFO_CNT(((uint32_t)args) & 0x7f);

        case DEVICE_CTRL_USB_DC_GET_EP_RX_FIFO_CNT:
            return USB_Get_EPx_RX_FIFO_CNT(((uint32_t)args) & 0x7f);
        case DEVICE_CTRL_ATTACH_TX_DMA /* constant-expression */:
            usb_device->tx_dma = (struct device *)args;
            break;

        case DEVICE_CTRL_ATTACH_RX_DMA /* constant-expression */:
            usb_device->rx_dma = (struct device *)args;
            break;

        case DEVICE_CTRL_USB_DC_SET_TX_DMA /* constant-expression */:
            USB_Set_EPx_TX_DMA_Interface_Config(((uint32_t)args) & 0x7f, ENABLE);
            break;

        case DEVICE_CTRL_USB_DC_SET_RX_DMA /* constant-expression */:
            USB_Set_EPx_RX_DMA_Interface_Config(((uint32_t)args) & 0x7f, ENABLE);
            break;

        default:
            break;
    }

